[
{
"id" : 1,
"poem" : "My doggy ate my essay. He picked up all my mail. He cleaned my dirty closet\nand dusted with his tail.\n\nHe straightened out my posters\nand swept my wooden floor.\nMy parents almost fainted\nwhen he fixed my bedroom door.\n\nI did not try to stop him.\nHe made my windows shine.\nMy room looked like a palace,\nand my dresser smelled like pine.\n\nHe fluffed up every pillow.\nHe folded all my clothes.\nHe even cleaned my fish tank\nwith a toothbrush and a hose.\n\nI thought it was amazing\nto see him use a broom.\nI’m glad he ate my essay\non “How to Clean My Room.",
"title" : "My Doggy Ate my Essay",
"author" : "Darren Sardelli",
"genre" : "Children"
},
{
"id" : 2,
"poem" : "Into my backyard’s six fat squares of concrete rigged with clothesline,   \nCharlie the Cop swung gunnysacks convulsed with Jersey chickens.   \nFrom the open view of other yards, unfolded down the block,   \nneighbor women watched ours boil tub water; the barechested men,   \nlaying out knives and cleavers, fumbled the animals into daylight,   \nin the middle of my world, my certain place, not stump roots   \non the cold Atlantic floor of mountains I’d imagined,   \none week every summer, from the hot Wildwood boardwalk.   \nBut just then Charlie lifted me above his head, saying   \n“O Billy Boy you've never in your life seen this! Want it?”\nThe ground gone, steep drag of thinned air, chicken squawk\ntingling in my ears with dim human voices. Charlie threw me in the sea.   \nThe underplace, swallowing my heart, opened like a horn of plenty,   \nblood channels lit blue and red like pinball arteries, flesh-motes,   \nmucus, sinew, pulsing viscera bits dripping from clothesline.   \nMissile tracks horned across the ceiling. In the ribcage,   \nstooped beggars crowded, kicking spongy gouts of something;   \ndeeper in the tunnel, toward the tail, in files winding out of sight,   \nshaved heads, men and women in pajamas. Spear carriers paced the walls.   \nInto my vaulted space came words not really words: shades, images   \nwith a worldly shape of meaning, but beyond me, aloof and hysterical.   \nThe silence wrapped me like a prickly woolen sleeve knit   \nby my women’s voices, shouting, out there, unrecoverable, dense,   \nwhile their horny hands plucked and the sweaty men teased,   \nstuffing tacky down inside their headscarves. Inside,\nblood cells combed my walls, unfinished patterns seeped through   \nas picturegrams that glided across the whale’s belly. A still life   \nwith ginger jar and pomegranates. A flayed, ripening Christ.\nAn Ohio puddler stirring pigiron mash, whose back is the same one   \nin Giotto’s Gethsemane that stays the hand slicing off a soldier’s ear.   \nMercury, my heart, the sickening beautiful shiftingness of things.   \nKettles steamed, tin basins quivered with guts, my dear hell’s bloodglyphs   \nin things, in me. I’d not be whole in and of the world again.   \nQuills cracked when Charlie put me down. In my backyard, in my head,   \nwomen sang under a pier to the unformed sea, an unvoiced song   \nI’d heard inside the monster, breezing now through clotheslines.   \nMen scrubbed their hands at the spigot, the women sighing.   \nFlies left charcoal scrawls on the air and grazed old stains;   \nthey lighted on my arms, not waiting, but constant, my familiars,   \nuntil their manic newsiness went away. Then, in that twilight,   \nslow, shadowless lightning bugs appeared, going on and off.",
"title" : "Saturday Afternoon",
"author" : " W. S. DI PIERO" ,
"genre" : "Folklore"
}
]
